# Pandas
* Pandas stands for Python for Data Analysis

In [1]:
import pandas as pd

In [4]:
a = pd.Series(5)
a

0    5
dtype: int64

In [5]:
a = pd.Series([1,3,4,7,8])
a

0    1
1    3
2    4
3    7
4    8
dtype: int64

In [7]:
a = pd.Series([1,3.24,4,7,8])
a

0    1.00
1    3.24
2    4.00
3    7.00
4    8.00
dtype: float64

In [11]:
a = pd.Series([1,3.24,4,7,8,4 + 5j])
a

0    1.00+0.00j
1    3.24+0.00j
2    4.00+0.00j
3    7.00+0.00j
4    8.00+0.00j
5    4.00+5.00j
dtype: complex128

In [12]:
a = pd.Series([1,3.24,4,7,8,4 + 5j,"Sumeet"])
a

0         1
1      3.24
2         4
3         7
4         8
5    (4+5j)
6    Sumeet
dtype: object

In [14]:
a.size

7

In [15]:
a.ndim

1

In [16]:
a.shape

(7,)

In [17]:
a = pd.Series([1,3.24,4,7,8,4 + 5j,"Sumeet"], index = ['a','b','c','d','e','f','g'])
a

a         1
b      3.24
c         4
d         7
e         8
f    (4+5j)
g    Sumeet
dtype: object

In [18]:
a1 = pd.DataFrame([a])
a1

   a     b  c  d  e         f       g
0  1  3.24  4  7  8  4.0+5.0j  Sumeet

### Series is 1-dimensional vs DataFrame is multidimenstionsional

In [19]:
#Create a list and convert it into Series and DataFrame
list = [1,2,3,4,5,6]
list

[1, 2, 3, 4, 5, 6]

In [26]:
list_S = pd.Series(list)
list_S

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [30]:
list_D = pd.DataFrame([list])
list_D

   0  1  2  3  4  5
0  1  2  3  4  5  6

In [33]:
#Create a dictionary and convert it into Series and DataFrame
dict = {"a": 1, "b": 2, "c": 3, "e": 4.0, "d": 5}
dict

{'a': 1, 'b': 2, 'c': 3, 'e': 4.0, 'd': 5}

In [34]:
dict_S = pd.Series(dict)
dict_S

a    1.0
b    2.0
c    3.0
e    4.0
d    5.0
dtype: float64

In [36]:
dict_D = pd.DataFrame([dict])
dict_D

   a  b  c    e  d
0  1  2  3  4.0  5

In [44]:
#numpy array to Series and dataframe
import numpy as np
a2 = np.arange(5)
a2

array([0, 1, 2, 3, 4])

In [39]:
a3 = pd.Series(a2)
a3

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [40]:
a4 = pd.DataFrame(a2)
a4

   0
0  0
1  1
2  2
3  3
4  4

In [46]:
#series to DataFrame
a5 = pd.Series([2,3,4.5,36])
a5

0     2.0
1     3.0
2     4.5
3    36.0
dtype: float64

In [43]:
a6 = pd.DataFrame(a5)
a6

      0
0   2.0
1   3.0
2   4.5
3  36.0

In [48]:
dict1 = {"day":["Mon","Tue","Wed","Thrus",], "Day": [1,2,3,4]}
dict1

{'day': ['Mon', 'Tue', 'Wed', 'Thrus'], 'Day': [1, 2, 3, 4]}

In [50]:
dict2 = pd.DataFrame(dict1)
dict2

     day  Day
0    Mon    1
1    Tue    2
2    Wed    3
3  Thrus    4

In [61]:
dict2["month"]=[10,11,12,1]
dict2

   Day  month
0    1     10
1    2     11
2    3     12
3    4      1

In [62]:
del dict2["month"]
dict2

   Day
0    1
1    2
2    3
3    4

In [64]:
import numpy as np

In [65]:
import pandas as pd

In [68]:
df = pd.read_csv(r"C:\Users\SUMEET\Downloads\heart.csv")

In [82]:
df.head(6)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
5,57,1,0,140,192,0,1,148,0,0.4,1,0,1,1

In [83]:
df1 = pd.read_csv("heart.csv")

In [85]:
df1.head(10)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
5,57,1,0,140,192,0,1,148,0,0.4,1,0,1,1
6,56,0,1,140,294,0,0,153,0,1.3,1,0,2,1
7,44,1,1,120,263,0,1,173,0,0.0,2,0,3,1
8,52,1,2,172,199,1,1,162,0,0.5,2,0,3,1
9,57,1,2,150,168,0,1,174,0,1.6,2,0,2,1

In [86]:
df.shape

(303, 14)

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       303 non-null    int64
 1   sex       303 non-null    int64
 2   cp        303 non-null    int64
 3   trestbps  303 non-null    int64
 4   chol      303 non-null    int64
 5   fbs       303 non-null    int64
 6   restecg   303 non-null    int64
 7   thalach   303 non-null    int64
 8   exang     303 non-null    int64
 9   oldpeak   303 non-null    float64
 10  slope     303 non-null    int64
 11  ca        303 non-null    int64
 12  thal      303 non-null    int64
 13  target    303 non-null    int64
dtypes: float64(1), int64(13)
memory usage: 33.3 KB

In [89]:
df.describe()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
count,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000
mean,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.399340,0.729373,2.313531,0.544554
std,9.082101,0.466011,1.032052,17.538143,51.830751,0.356198,0.525860,22.905161,0.469794,1.161075,0.616226,1.022606,0.612277,0.498835
min,29.000000,0.000000,0.000000,94.000000,126.000000,0.000000,0.000000,71.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,47.500000,0.000000,0.000000,120.000000,211.000000,0.000000,0.000000,133.500000,0.000000,0.000000,1.000000,0.000000,2.000000,0.000000
50%,55.000000,1.000000,1.000000,130.000000,240.000000,0.000000,1.000000,153.000000,0.000000,0.800000,1.000000,0.000000,2.000000,1.000000
75%,61.000000,1.000000,2.000000,140.000000,274.500000,0.000000,1.000000,166.000000,1.000000,1.600000,2.000000,1.000000,3.000000,1.000000
max,77.000000,1.000000,3.000000,200.000000,564.000000,1.000000,2.000000,202.000000,1.000000,6.200000,2.000000,4.000000,3.000000,1.000000

In [90]:
df.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

# Data cleaning

In [93]:
df.isnull().sum()

age         0
sex         0
cp          0
trestbps    0
chol        0
fbs         0
restecg     0
thalach     0
exang       0
oldpeak     0
slope       0
ca          0
thal        0
target      0
dtype: int64

In [94]:
df.isna().sum()

age         0
sex         0
cp          0
trestbps    0
chol        0
fbs         0
restecg     0
thalach     0
exang       0
oldpeak     0
slope       0
ca          0
thal        0
target      0
dtype: int64